app/controllers/customer/cart_items_controller.rb

INSERT INTO "cart_items" ("pizza_id", "member_id", "number_of_sheets", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["pizza_id", 1], ["member_id", 1], ["number_of_sheets", 1], ["created_at", "2021-03-08 01:35:49.260402"], ["updated_at", "2021-03-08 01:35:49.260402"]]
---
  def create
    @cart_item = CartItem.new(cart_item_params_create)
    @cart_item.member_id = current_member.id
    @cart_item.pizza_id = params[:pizza_id]
    @cart_item.save

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "number_of_sheets" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["number_of_sheets", 2], ["updated_at", "2021-03-08 02:11:53.304253"], ["id", 1]]
---
  def update
    @cart_item = CartItem.find(params[:id])
    @cart_item = CartItem.update(cart_item_params_update)

DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 18]]
---
  def destroy_all
    current_member.cart_items.destroy_all

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."member_id" = ?  [["member_id", 1]]
---
  def calculate(member)
    total_price = 0
    member.cart_items.each do |cart_item|