app/controllers/customer/deliveries_controller.rb

SELECT "deliveries".* FROM "deliveries" WHERE "deliveries"."member_id" = ?  [["member_id", 1]]
---
  def index
    @deliveries = Delivery.where(member_id: current_member.id)

INSERT INTO "deliveries" ("member_id", "name", "postal_code", "address", "telephone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @delivery = Delivery.new(delivery_create_params)
    @delivery.member_id = current_member.id
    if @delivery.save

SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @delivery = Delivery.find(params[:id])

SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "deliveries" SET "name" = ?, "address" = ?, "telephone_number" = ?, "updated_at" = ? WHERE "deliveries"."id" = ?  [["name", "スズー機"], ["address", "東京都西東京市東伏見5-6-14"], ["telephone_number", 8047244238], ["updated_at", "2021-03-17 05:40:19.434902"], ["id", 2]]
---
  def update
    @delivery = Delivery.find(params[:id])
     if @delivery.update(delivery_params)