app/controllers/customer/members_controller.rb

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "full_name" = ?, "full_name_kana" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["full_name", "青嶋陽介"], ["full_name_kana", "アオシマヨウスケ"], ["updated_at", "2021-03-10 00:34:58.323466"], ["id", 1]]
---
  def update
    @member = Member.find(params[:id])
    if @member.update(update_params)

UPDATE "members" SET "withdrawal_status" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["withdrawal_status", nil], ["updated_at", "2021-03-13 05:39:43.253532"], ["id", 1]]
---
  def withdrawal
  # withdrawal_statusをfalseにし、「退会」ステータスに変更する
    current_member.update(withdrawal_status: "退会")