app/controllers/customer/orders_controller.rb

  def create_delivery
    @delivery = Delivery.new(create_delivery_params)
    @delivery.member_id = current_member.id
    if @delivery.save
---
INSERT INTO "deliveries" ("member_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["member_id", 1], ["created_at", "2021-03-09 02:44:41.106579"], ["updated_at", "2021-03-09 02:44:41.106579"]]

  def confirm
    @order = current_member.orders
    @delivery_person = Delivery.find_by(member_id: current_member.id)
---
SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."member_id" = ? LIMIT ?  [["member_id", 1], ["LIMIT", 1]]