app/controllers/customer/orders_controller.rb

  def new
    @order = Order.new
    @deliveries = Delivery.where(member_id: current_member.id)
---
SELECT  "deliveries".* FROM "deliveries" WHERE "deliveries"."member_id" = ? LIMIT ?  [["member_id", 1], ["LIMIT", 1]]

  def create
    # 注文情報の保存
    @order = Order.new
    @order.member_id = current_member.id
    @order.delivery_postal_code = session[:postal_code]
    @order.delivery_address = session[:address]
    @order.delivery_name = session[:name]
    @order.delivery_telephone_number = session[:telephone_number]
    @order.payment_method = session[:payment_method]
    @order.billing_amount = calculate(current_member)
    @order.order_status = 0
    @order.save

    # 注文商品ごとの詳細データの保存
    current_member.cart_items.each do |cart|
      @order_pizza = OrderPizza.new
      @order_pizza.order_id = @order.id
      @order_pizza.pizza_id = cart.pizza.id
      @order_pizza.price = cart.pizza.price
      @order_pizza.number_of_sheets = cart.number_of_sheets
      @order_pizza.cooking_status = 0
      @order_pizza.save
    end

    # 現在ユーザーのカート内データ、及び支払方法・お届け先データの削除
    current_member.cart_items.destroy_all
---
INSERT INTO "deliveries" ("member_id", "name", "postal_code", "address", "telephone_number", "created_at", "updated_at", "payment_method") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "orders" ("member_id", "delivery_address", "delivery_name", "delivery_telephone_number", "billing_amount", "payment_method", "created_at", "updated_at", "delivery_postal_code") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."member_id" = ?  [["member_id", 1]]
INSERT INTO "order_pizzas" ("order_id", "pizza_id", "price", "number_of_sheets", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 3], ["pizza_id", 2], ["price", 1400], ["number_of_sheets", 1], ["created_at", "2021-03-15 01:15:43.292798"], ["updated_at", "2021-03-15 01:15:43.292798"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 19]]

  def index
    @orders = Order.where(member_id: current_member.id).order(created_at: :desc)
---
SELECT "orders".* FROM "orders" WHERE "orders"."member_id" = ? ORDER BY "orders"."created_at" DESC  [["member_id", 1]]

  def show
    @order = Order.find(params[:id])
    @order_pizzas = @order.order_pizzas
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "order_pizzas".* FROM "order_pizzas" WHERE "order_pizzas"."order_id" = ?  [["order_id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def calculate(member)
    total_price = 0
    member.cart_items.each do |cart_item|
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."member_id" = ?  [["member_id", 1]]