app/controllers/customer/orders_controller.rb

SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @order = Order.find(params[:id])
    @order_pizzas = @order.order_pizzas