app/controllers/customer/pizzas_controller.rb

  def index
    @pizzas = Pizza.all.order(created_at: :desc)
    @pizzas = Pizza.page(params[:page]).per(6)
---
SELECT "pizzas".* FROM "pizzas" ORDER BY "pizzas"."created_at" DESC
SELECT  "pizzas".* FROM "pizzas" ORDER BY "pizzas"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "pizzas"

  def show
    @pizza = Pizza.find(params[:id])
---
SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]