app/controllers/customer/sessions_controller.rb

SELECT  "members".* FROM "members" WHERE "members"."email" = ? LIMIT ?  [["email", "brotherhood7362514@gmail.com"], ["LIMIT", 1]]
---
  def reject_after_withdrawal_member
    @member = Member.find_by(email: params[:member][:email])