app/controllers/admin/homes_controller.rb

  def top
    @orders = Order.all.order(created_at: :desc)
    @orders = Order.page(params[:page]).per(10)
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC
SELECT  "orders".* FROM "orders" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]