app/controllers/admin/members_controller.rb

  def index
    @members = Member.all.order(created_at: :desc)
    @members = Member.page(params[:page]).per(9)
---
SELECT "members".* FROM "members" ORDER BY "members"."created_at" DESC
SELECT  "members".* FROM "members" LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]

  def update
    @member = Member.find(params[:id])
    if @member.update(member_params)
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "withdrawal_status" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["withdrawal_status", 1], ["updated_at", "2021-03-15 00:32:41.793333"], ["id", 1]]