app/controllers/admin/orders_controller.rb

  def show
    @order = Order.find(params[:id])
    @order_pizzas = @order.order_pizzas
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_pizzas".* FROM "order_pizzas" WHERE "order_pizzas"."order_id" = ?  [["order_id", 1]]

  def update
    @order = Order.find(params[:id])
    @order_pizzas = @order.order_pizzas
    @order.update(order_params)

    # 注文ステータスを「入金確認」にすると、調理ステータスが「調理中」に更新される処理
    if @order.order_status == "入金確認"
      @order_pizzas.update_all(cooking_status: "調理中")
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "order_pizzas" SET "cooking_status" = 0 WHERE "order_pizzas"."order_id" = ?  [["order_id", 1]]
UPDATE "orders" SET "order_status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_status", 1], ["updated_at", "2021-03-09 10:28:41.538967"], ["id", 1]]