app/controllers/admin/pizzas_controller.rb

SELECT "pizzas".* FROM "pizzas" ORDER BY "pizzas"."created_at" DESC
SELECT  "pizzas".* FROM "pizzas" LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]
SELECT COUNT(*) FROM "pizzas"
---
  def index
    @pizzas = Pizza.all.order(created_at: :desc)
    @pizzas = Pizza.page(params[:page]).per(9)

INSERT INTO "pizzas" ("pizza_name", "image_id", "price", "pizza_size", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @pizza = Pizza.new(pizza_params)
    if @pizza.save

SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @pizza = Pizza.find(params[:id])

SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @pizza = Pizza.find(params[:id])

SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "pizzas" SET "image_id" = ?, "sales_status" = ?, "updated_at" = ? WHERE "pizzas"."id" = ?  [["image_id", "c400806ccf6f50ff2d859133f9c31dd579cf4cbfbce0e34fe4c831f81a61"], ["sales_status", 0], ["updated_at", "2021-03-03 08:29:22.528750"], ["id", 3]]
---
  def update
    @pizza = Pizza.find(params[:id])
    if @pizza.update(pizza_params)

SELECT  "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "pizzas" WHERE "pizzas"."id" = ?  [["id", 2]]
---
  def destroy
    @pizza = Pizza.find(params[:id])
    @pizza.destroy