app/views/customer/orders/confirm.html.erb

            <tbody>
            <% current_member.cart_items.each do |cart| %>
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."member_id" = ?  [["member_id", 1]]