app/views/admin/orders/show.html.erb

                <%= form_with model: order_pizza, url: admin_order_pizza_path(order_pizza), method: :patch, local: true do |f| %>
                  <%= f.select :cooking_status, OrderPizza.cooking_statuses.keys, class: "form-control" %>
---
SELECT "order_pizzas".* FROM "order_pizzas" WHERE "order_pizzas"."order_id" = ?  [["order_id", 1]]