app/views/admin/homes/top.html.erb

SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC
SELECT SUM("order_pizzas"."number_of_sheets") FROM "order_pizzas" WHERE "order_pizzas"."order_id" = ?  [["order_id", 1]]
---
              <td>
                <%= order.order_pizzas.sum(:number_of_sheets) %> 枚